TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/cla.h
//###########################################################################
//
// FILE:   cla.h
//
// TITLE:  CLA Driver Implementation File
//
//###########################################################################
// $Copyright:
// Copyright (C) 2022 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef CLA_H
#define CLA_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup cla_api CLA
//! \brief This module is used for configurating CLA.
//! @{
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "cpu.h"
#include "debug.h"
#include "inc/hw_cla.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"

//*****************************************************************************
//
// Useful defines used within the driver functions. Not intended for use by
// application code.
//
//*****************************************************************************
#define CLA_NUM_EOT_INTERRUPTS          (8U)

#ifdef __TMS320C28XX__  // This enum is only accessible by C28x
//*****************************************************************************
//
//! Values that can be passed to CLA_getBackgroundTaskStatus() as the
//! \e stsFlag parameter.
//
//*****************************************************************************
typedef enum
{
    //! Run status
    CLA_BGSTS_RUNNING          = CLA_MSTSBGRND_RUN,
    //! Can BG task be interrupted?
    CLA_BGSTS_CANNOT_INTERRUPT = CLA_MSTSBGRND_BGINTM,
    //! BG task hardware trigger overflow - if a second trigger occurs
    //! while the BG is already running, the overflow is set
    CLA_BGSTS_OVERFLOW         = CLA_MSTSBGRND_BGOVF
} CLA_BGTaskStatus;
#endif // __TMS320C28XX__

//*****************************************************************************
//
// Values that can be passed to CLA_clearTaskFlags(), CLA_forceTasks(),
// and CLA_enableTasks(), CLA_disableTasks(), and CLA_enableSoftwareInterrupt()
// as the taskFlags parameter.
//
//*****************************************************************************
#define CLA_TASKFLAG_1          (0x01U)  //!< CLA Task 1 Flag
#define CLA_TASKFLAG_2          (0x02U)  //!< CLA Task 2 Flag
#define CLA_TASKFLAG_3          (0x04U)  //!< CLA Task 3 Flag
#define CLA_TASKFLAG_4          (0x08U)  //!< CLA Task 4 Flag
#define CLA_TASKFLAG_5          (0x10U)  //!< CLA Task 5 Flag
#define CLA_TASKFLAG_6          (0x20U)  //!< CLA Task 6 Flag
#define CLA_TASKFLAG_7          (0x40U)  //!< CLA Task 7 Flag
#define CLA_TASKFLAG_8          (0x80U)  //!< CLA Task 8 Flag
#define CLA_TASKFLAG_ALL        (0xFFU)  //!< CLA All Task Flag

//*****************************************************************************
//
//! Values that can be passed to CLA_getPendingTaskFlag(),
//! CLA_getTaskOverflowFlag(), CLA_getTaskRunStatus(), CLA_setTriggerSource(),
//! CLA_registerEndOfTaskInterrupt(), and CLA_unregisterEndOfTaskInterrupt()
//! as the taskNumber parameter.
//
//*****************************************************************************
typedef enum
{
    CLA_TASK_1,  //!< CLA Task 1
    CLA_TASK_2,  //!< CLA Task 2
    CLA_TASK_3,  //!< CLA Task 3
    CLA_TASK_4,  //!< CLA Task 4
    CLA_TASK_5,  //!< CLA Task 5
    CLA_TASK_6,  //!< CLA Task 6
    CLA_TASK_7,  //!< CLA Task 7
    CLA_TASK_8   //!< CLA Task 8
} CLA_TaskNumber;

#ifdef __TMS320C28XX__  // These enums are only accessible by C28x
//*****************************************************************************
//
//! Values that can be passed to CLA_mapTaskVector() as the \e claIntVect
//! parameter.
//
//*****************************************************************************
typedef enum
{
    CLA_MVECT_1 = CLA_O_MVECT1,     //!< Task Interrupt Vector 1
    CLA_MVECT_2 = CLA_O_MVECT2,     //!< Task Interrupt Vector 2
    CLA_MVECT_3 = CLA_O_MVECT3,     //!< Task Interrupt Vector 3
    CLA_MVECT_4 = CLA_O_MVECT4,     //!< Task Interrupt Vector 4
    CLA_MVECT_5 = CLA_O_MVECT5,     //!< Task Interrupt Vector 5
    CLA_MVECT_6 = CLA_O_MVECT6,     //!< Task Interrupt Vector 6
    CLA_MVECT_7 = CLA_O_MVECT7,     //!< Task Interrupt Vector 7
    CLA_MVECT_8 = CLA_O_MVECT8      //!< Task Interrupt Vector 8
} CLA_MVECTNumber;

//*****************************************************************************
//
//! Values that can be passed to CLA_setTriggerSource() as the \e trigger
//! parameter.
//
//*****************************************************************************
typedef enum
{
	CLA_TRIGGER_SOFTWARE		 = 0,	//!CLA Task Trigger Source is Software
	CLA_TRIGGER_ADCA1		 = 1,	//!CLA Task Trigger Source is ADCA1
	CLA_TRIGGER_ADCA2		 = 2,	//!CLA Task Trigger Source is ADCA2
	CLA_TRIGGER_ADCA3		 = 3,	//!CLA Task Trigger Source is ADCA3
	CLA_TRIGGER_ADCA4		 = 4,	//!CLA Task Trigger Source is ADCA4
	CLA_TRIGGER_ADCAEVT		 = 5,	//!CLA Task Trigger Source is ADCAEVT
	CLA_TRIGGER_ADCB1		 = 6,	//!CLA Task Trigger Source is ADCB1
	CLA_TRIGGER_ADCB2		 = 7,	//!CLA Task Trigger Source is ADCB2
	CLA_TRIGGER_ADCB3		 = 8,	//!CLA Task Trigger Source is ADCB3
	CLA_TRIGGER_ADCB4		 = 9,	//!CLA Task Trigger Source is ADCB4
	CLA_TRIGGER_ADCBEVT		 = 10,	//!CLA Task Trigger Source is ADCBEVT
	CLA_TRIGGER_ADCC1		 = 11,	//!CLA Task Trigger Source is ADCC1
	CLA_TRIGGER_ADCC2		 = 12,	//!CLA Task Trigger Source is ADCC2
	CLA_TRIGGER_ADCC3		 = 13,	//!CLA Task Trigger Source is ADCC3
	CLA_TRIGGER_ADCC4		 = 14,	//!CLA Task Trigger Source is ADCC4
	CLA_TRIGGER_ADCCEVT		 = 15,	//!CLA Task Trigger Source is ADCCEVT
	CLA_TRIGGER_ADCD1		 = 16,	//!CLA Task Trigger Source is ADCD1
	CLA_TRIGGER_ADCD2		 = 17,	//!CLA Task Trigger Source is ADCD2
	CLA_TRIGGER_ADCD3		 = 18,	//!CLA Task Trigger Source is ADCD3
	CLA_TRIGGER_ADCD4		 = 19,	//!CLA Task Trigger Source is ADCD4
	CLA_TRIGGER_ADCDEVT		 = 20,	//!CLA Task Trigger Source is ADCDEVT
	CLA_TRIGGER_XINT1		 = 29,	//!CLA Task Trigger Source is XINT1
	CLA_TRIGGER_XINT2		 = 30,	//!CLA Task Trigger Source is XINT2
	CLA_TRIGGER_XINT3		 = 31,	//!CLA Task Trigger Source is XINT3
	CLA_TRIGGER_XINT4		 = 32,	//!CLA Task Trigger Source is XINT4
	CLA_TRIGGER_XINT5		 = 33,	//!CLA Task Trigger Source is XINT5
	CLA_TRIGGER_EPWM1INT		 = 36,	//!CLA Task Trigger Source is EPWM1INT
	CLA_TRIGGER_EPWM2INT		 = 37,	//!CLA Task Trigger Source is EPWM2INT
	CLA_TRIGGER_EPWM3INT		 = 38,	//!CLA Task Trigger Source is EPWM3INT
	CLA_TRIGGER_EPWM4INT		 = 39,	//!CLA Task Trigger Source is EPWM4INT
	CLA_TRIGGER_EPWM5INT		 = 40,	//!CLA Task Trigger Source is EPWM5INT
	CLA_TRIGGER_EPWM6INT		 = 41,	//!CLA Task Trigger Source is EPWM6INT
	CLA_TRIGGER_EPWM7INT		 = 42,	//!CLA Task Trigger Source is EPWM7INT
	CLA_TRIGGER_EPWM8INT		 = 43,	//!CLA Task Trigger Source is EPWM8INT
	CLA_TRIGGER_EPWM9INT		 = 44,	//!CLA Task Trigger Source is EPWM9INT
	CLA_TRIGGER_EPWM10INT		 = 45,	//!CLA Task Trigger Source is EPWM10INT
	CLA_TRIGGER_EPWM11INT		 = 46,	//!CLA Task Trigger Source is EPWM11INT
	CLA_TRIGGER_EPWM12INT		 = 47,	//!CLA Task Trigger Source is EPWM12INT
	CLA_TRIGGER_MCANA_FEVT0		 = 52,	//!CLA Task Trigger Source is MCANAFEVT0
	CLA_TRIGGER_MCANA_FEVT1		 = 53,	//!CLA Task Trigger Source is MCANAFEVT1
	CLA_TRIGGER_MCANA_FEVT2		 = 54,	//!CLA Task Trigger Source is MCANAFEVT2
	CLA_TRIGGER_MCANB_FEVT0		 = 55,	//!CLA Task Trigger Source is MCANBFEVT0
	CLA_TRIGGER_MCANB_FEVT1		 = 56,	//!CLA Task Trigger Source is MCANBFEVT1
	CLA_TRIGGER_MCANB_FEVT2		 = 57,	//!CLA Task Trigger Source is MCANBFEVT2
	CLA_TRIGGER_TINT0		 = 68,	//!CLA Task Trigger Source is TINT0
	CLA_TRIGGER_TINT1		 = 69,	//!CLA Task Trigger Source is TINT1
	CLA_TRIGGER_TINT2		 = 70,	//!CLA Task Trigger Source is TINT2
	CLA_TRIGGER_ECAP1INT		 = 75,	//!CLA Task Trigger Source is ECAP1INT
	CLA_TRIGGER_ECAP2INT		 = 76,	//!CLA Task Trigger Source is ECAP2INT
	CLA_TRIGGER_EQEP1INT		 = 83,	//!CLA Task Trigger Source is EQEP1INT
	CLA_TRIGGER_EQEP2INT		 = 84,	//!CLA Task Trigger Source is EQEP2INT
	CLA_TRIGGER_EQEP3INT		 = 85,	//!CLA Task Trigger Source is EQEP3INT
	CLA_TRIGGER_LINAINT1		 = 99,	//!CLA Task Trigger Source is LINAINT1
	CLA_TRIGGER_LINAINT0		 = 100,	//!CLA Task Trigger Source is LINAINT0
	CLA_TRIGGER_PMBUSAINT		 = 105,	//!CLA Task Trigger Source is PMBUSAINT
	CLA_TRIGGER_SPITXAINT		 = 109,	//!CLA Task Trigger Source is SPITXAINT
	CLA_TRIGGER_SPIRXAINT		 = 110,	//!CLA Task Trigger Source is SPIRXAINT
	CLA_TRIGGER_SPITXBINT		 = 111,	//!CLA Task Trigger Source is SPITXBINT
	CLA_TRIGGER_SPIRXBINT		 = 112,	//!CLA Task Trigger Source is SPIRXBINT
	CLA_TRIGGER_FSITXAINT1		 = 123,	//!CLA Task Trigger Source is FSITXAINT1
	CLA_TRIGGER_FSITXAINT2		 = 124,	//!CLA Task Trigger Source is FSITXAINT2
	CLA_TRIGGER_FSIRXAINT1		 = 125,	//!CLA Task Trigger Source is FSIRXAINT1
	CLA_TRIGGER_FSIRXAINT2		 = 126,	//!CLA Task Trigger Source is FSIRXAINT2
	CLA_TRIGGER_CLB1INT		 = 127,	//!CLA Task Trigger Source is CLB1INT
	CLA_TRIGGER_CLB2INT		 = 128,	//!CLA Task Trigger Source is CLB2INT
	CLA_TRIGGER_ADCE1		 = 137,	//!CLA Task Trigger Source is ADCE1
	CLA_TRIGGER_ADCE2		 = 138,	//!CLA Task Trigger Source is ADCE2
	CLA_TRIGGER_ADCE3		 = 139,	//!CLA Task Trigger Source is ADCE3
	CLA_TRIGGER_ADCE4		 = 140,	//!CLA Task Trigger Source is ADCE4
	CLA_TRIGGER_ADCEEVT		 = 141,	//!CLA Task Trigger Source is ADCEEVT
	CLA_TRIGGER_DMACH1INT		 = 184,	//!CLA Task Trigger Source is DMA_CH1INT
	CLA_TRIGGER_DMACH2INT		 = 185,	//!CLA Task Trigger Source is DMA_CH2INT
	CLA_TRIGGER_DMACH3INT		 = 186,	//!CLA Task Trigger Source is DMA_CH3INT
	CLA_TRIGGER_DMACH4INT		 = 187,	//!CLA Task Trigger Source is DMA_CH4INT
	CLA_TRIGGER_DMACH5INT		 = 188,	//!CLA Task Trigger Source is DMA_CH5INT
	CLA_TRIGGER_DMACH6INT		 = 189	//!CLA Task Trigger Source is DMA_CH6INT
} CLA_Trigger;

